## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 69 to add, 0 to change, 69 to destroy.</code></pre>

* Replace
  * module.subscription[&#34;CRIME-ADO-POC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-AWS-Migration&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Idam-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-Sandbox&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFT-VH-Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPSDATA-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-Prod&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-CNP-QA&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Development&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-RDO-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DCD-ROBOTICS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-ARCHIVING-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTPTL-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-CFTSBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-DACS-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-EXTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-HERITAGE-INTSVC-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-STG&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-PROD&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;HMCTS-SOC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian LVE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MOJ DCD Atlassian NLE&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Functional Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Non-Live Management&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Online Plea Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pilot&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Production&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform Security Operations&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Common Platform System Integration Testing&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;MoJ Operational Services Validation&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-MI-SB&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["CRIME-ADO-POC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleAssignments/c8ef14de-74b7-0d0f-18d6-cb7c244ec600" -> (known after apply)
      ~ name                             = "c8ef14de-74b7-0d0f-18d6-cb7c244ec600" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ef8dd153-3fba-47a4-be65-15775bcde240/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-AWS-Migration"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleAssignments/4cc2b420-4b14-bd04-914a-d319b976b0df" -> (known after apply)
      ~ name                             = "4cc2b420-4b14-bd04-914a-d319b976b0df" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/58a2ce36-4e09-467b-8330-d164aa559c68/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-Idam-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b/providers/Microsoft.Authorization/roleAssignments/92bae9fe-4d2f-8645-1a6b-b6b5deea02b0" -> (known after apply)
      ~ name                             = "92bae9fe-4d2f-8645-1a6b-b6b5deea02b0" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ddd45636-d58a-437f-8ad8-99b0add0092b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-Sandbox"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleAssignments/101177f7-85fb-bd4a-8d05-3de36d56dbff" -> (known after apply)
      ~ name                             = "101177f7-85fb-bd4a-8d05-3de36d56dbff" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFT-VH-Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleAssignments/2a517a12-9f47-4d5d-6f33-be5c6d63c8e6" -> (known after apply)
      ~ name                             = "2a517a12-9f47-4d5d-6f33-be5c6d63c8e6" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4bb049c8-33f3-4860-91b4-9ee45375cc18/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleAssignments/b9494319-51cc-9e2b-b5a7-caf6ca7fc5ae" -> (known after apply)
      ~ name                             = "b9494319-51cc-9e2b-b5a7-caf6ca7fc5ae" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleAssignments/f5aa1c1e-df8f-6f3c-dfbd-18b742690b2c" -> (known after apply)
      ~ name                             = "f5aa1c1e-df8f-6f3c-dfbd-18b742690b2c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8b6ea922-0862-443e-af15-6056e1c9b9a4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-ITHC"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleAssignments/5226fe8b-a054-ce4e-615f-691bb247aa47" -> (known after apply)
      ~ name                             = "5226fe8b-a054-ce4e-615f-691bb247aa47" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-PROD"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleAssignments/8bdb1ced-080d-a5c7-1c74-82eafdb1a5bc" -> (known after apply)
      ~ name                             = "8bdb1ced-080d-a5c7-1c74-82eafdb1a5bc" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleAssignments/6ba92725-74d3-2ce5-d8e2-56b35cda8753" -> (known after apply)
      ~ name                             = "6ba92725-74d3-2ce5-d8e2-56b35cda8753" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-STG"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleAssignments/3d39a86b-966b-35e4-0d8a-c9ab53206334" -> (known after apply)
      ~ name                             = "3d39a86b-966b-35e4-0d8a-c9ab53206334" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPS-TEST"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleAssignments/98b78681-b5fb-c15c-9c04-c15bc8f35043" -> (known after apply)
      ~ name                             = "98b78681-b5fb-c15c-9c04-c15bc8f35043" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CFTAPPSDATA-DEMO"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleAssignments/ce4abf91-390a-817b-f7d1-a48d74aef718" -> (known after apply)
      ~ name                             = "ce4abf91-390a-817b-f7d1-a48d74aef718" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/dbd3a97b-580e-4ecb-9ed3-4e86f6f23d25/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-DEV"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleAssignments/890aace2-ea44-4708-11f8-96c0d556572d" -> (known after apply)
      ~ name                             = "890aace2-ea44-4708-11f8-96c0d556572d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-Prod"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleAssignments/c5db91a3-dfa1-3bb7-2724-1792ac714e86" -> (known after apply)
      ~ name                             = "c5db91a3-dfa1-3bb7-2724-1792ac714e86" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-CNP-QA"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleAssignments/5afd8f05-e181-e249-ac9c-8ed4e2dc15fe" -> (known after apply)
      ~ name                             = "5afd8f05-e181-e249-ac9c-8ed4e2dc15fe" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleAssignments/5fe96f4a-243a-f2e8-1e8a-f8ec26087c7e" -> (known after apply)
      ~ name                             = "5fe96f4a-243a-f2e8-1e8a-f8ec26087c7e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["DCD-RDO-Development"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/fa397675-6ddf-4cb0-b1fc-bc7df0e51bf4/providers/Microsoft.Authorization/roleAssignments/81d72fe3-25b7-0b41-c83f-787d59147f1b" -> (known after apply)
      ~ name                             = "81d72fe3-25b7-0b41-c83f-787d59147f1b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["HMCTS-SOC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/providers/Microsoft.Authorization/roleAssignments/cf5f637d-137d-5456-55ed-20a6d928e69a" -> (known after apply)
      ~ name                             = "cf5f637d-137d-5456-55ed-20a6d928e69a" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MOJ DCD Atlassian LVE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/providers/Microsoft.Authorization/roleAssignments/92472d4e-4b66-8c3a-9de5-ab5b0038726b" -> (known after apply)
      ~ name                             = "92472d4e-4b66-8c3a-9de5-ab5b0038726b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MOJ DCD Atlassian NLE"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleAssignments/cfdfabca-01db-7835-d4e0-7c09a6bee485" -> (known after apply)
      ~ name                             = "cfdfabca-01db-7835-d4e0-7c09a6bee485" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Non-Functional Testing"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/274541e0-1d81-4466-82af-15cd40e86c96/providers/Microsoft.Authorization/roleAssignments/7bf6c738-30c2-7f59-3763-9aaf07b1e62b" -> (known after apply)
      ~ name                             = "7bf6c738-30c2-7f59-3763-9aaf07b1e62b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/274541e0-1d81-4466-82af-15cd40e86c96/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Non-Live Management"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3/providers/Microsoft.Authorization/roleAssignments/0356e1eb-7762-3d74-1187-affeb0e56c4b" -> (known after apply)
      ~ name                             = "0356e1eb-7762-3d74-1187-affeb0e56c4b" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/66cfcc0b-d764-4c07-bbeb-0a74101dbcf3/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Online Plea Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/e854024f-5d34-4043-a7a7-cbf4bb6f4d67/providers/Microsoft.Authorization/roleAssignments/34525ca6-1ef5-4118-f97a-4574ded421ca" -> (known after apply)
      ~ name                             = "34525ca6-1ef5-4118-f97a-4574ded421ca" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/e854024f-5d34-4043-a7a7-cbf4bb6f4d67/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Online Plea Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/5ff94e9e-4276-4e4b-b36b-475101d613d4/providers/Microsoft.Authorization/roleAssignments/225c6eb9-2455-e14e-474f-d0fce6dc6137" -> (known after apply)
      ~ name                             = "225c6eb9-2455-e14e-474f-d0fce6dc6137" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/5ff94e9e-4276-4e4b-b36b-475101d613d4/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Operational Services"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937/providers/Microsoft.Authorization/roleAssignments/e31b0b81-ac50-ed57-ee66-65d954a40b34" -> (known after apply)
      ~ name                             = "e31b0b81-ac50-ed57-ee66-65d954a40b34" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/28d33a47-7c14-456d-9a40-ce9c9b5a3937/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pilot"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a/providers/Microsoft.Authorization/roleAssignments/3f1ed4c7-4261-4b70-ffb3-edcbcbda674d" -> (known after apply)
      ~ name                             = "3f1ed4c7-4261-4b70-ffb3-edcbcbda674d" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/4c335e3a-f3d5-41cb-91d5-f2816853a22a/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90/providers/Microsoft.Authorization/roleAssignments/a481c7d8-858a-842b-f266-cb02ac588a66" -> (known after apply)
      ~ name                             = "a481c7d8-858a-842b-f266-cb02ac588a66" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/3d84f717-22a0-4f4e-aac7-5ff8f4ee0a90/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Production"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f/providers/Microsoft.Authorization/roleAssignments/807ce540-f8a8-d83c-e9ed-05dcd8f061e7" -> (known after apply)
      ~ name                             = "807ce540-f8a8-d83c-e9ed-05dcd8f061e7" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/55c2f45e-1381-4b17-9bd0-f85215b8bb4f/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Security Operations"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/c7d20737-15ae-45da-bec4-67da9c029ddc/providers/Microsoft.Authorization/roleAssignments/7e9e3b96-0840-45b5-80d5-149ee6a27ca9" -> (known after apply)
      ~ name                             = "7e9e3b96-0840-45b5-80d5-149ee6a27ca9" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/c7d20737-15ae-45da-bec4-67da9c029ddc/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform System Integration Testing"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/12ffc6f5-7035-41fc-b96a-846d8fedc94b/providers/Microsoft.Authorization/roleAssignments/7fa22a19-73b1-408d-1ec1-6b8be5e954bb" -> (known after apply)
      ~ name                             = "7fa22a19-73b1-408d-1ec1-6b8be5e954bb" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/12ffc6f5-7035-41fc-b96a-846d8fedc94b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["MoJ Operational Services Validation"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b/providers/Microsoft.Authorization/roleAssignments/350bdc5a-6774-1934-d2e8-476138e29043" -> (known after apply)
      ~ name                             = "350bdc5a-6774-1934-d2e8-476138e29043" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/6491a35d-b1cc-4823-8340-0b847abc9a1b/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-MI-SB"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce/providers/Microsoft.Authorization/roleAssignments/cb272cc2-48ae-65e4-46c4-3fd6a2ab57f7" -> (known after apply)
      ~ name                             = "cb272cc2-48ae-65e4-46c4-3fd6a2ab57f7" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/abe4bc04-16e5-42dd-9aad-464f70ebc2ce/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleAssignments/41db76b9-be2c-b898-55c7-22683859458f" -> (known after apply)
      ~ name                             = "41db76b9-be2c-b898-55c7-22683859458f" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] must be replaced
-/+ resource "azurerm_role_assignment" "local_custom_role_assignments" {
      ~ id                               = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/providers/Microsoft.Authorization/roleAssignments/44c5553d-c9d9-9778-864c-adfba0e4e4d1" -> (known after apply)
      ~ name                             = "44c5553d-c9d9-9778-864c-adfba0e4e4d1" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" -> "/providers/Microsoft.Authorization/roleDefinitions/cc6362c6-ec1a-ce79-4c72-714b539002af" # forces replacement
      ~ role_definition_name             = "Application Gateway Backend Health Reader" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 69 to add, 0 to change, 69 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":75,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->